{"sections":{"main":{"type":"main-page","disabled":true,"settings":{"padding_top":28,"padding_bottom":28}},"4d857918-30a5-4284-9758-90cf1d9f713a":{"type":"faqs","blocks":{"ce3f264c-63c3-4dff-9c24-d43aadbfcd72":{"type":"text","settings":{"button_heading":"Do I need to set up an account to place order?","button_content":"<p>You can shop at adoro.com.pk, either by registering your Email ID with us or using a guest account to checkout.<\/p>"}},"b60be7a9-c3d7-466b-800d-ac7e6f5d5f97":{"type":"text","settings":{"button_heading":"How can I select an item to purchase?","button_content":"<p>As you browse through the Adoro Website, click on the Add to Cart button for the items that you wish to purchase, after selecting required color and Size.<\/p>"}},"6e59c27c-5a19-43eb-b930-0e8932cc3879":{"type":"text","settings":{"button_heading":"How do I place an order on ADORO website?","button_content":"<p>To complete the purchase process, add your desired item to the shopping cart and click on the cart icon. Choose between Guest checkout or signing up for updates, provide personal details, select payment method, and proceed to confirmation. Review the summary of your order, cancel or select Order now. Receive a verification code to confirm the purchase.<\/p>"}},"45afb32a-4202-40fd-8031-366ad480440b":{"type":"text","settings":{"button_heading":"What are your payment options?","button_content":"<p>ADORO offers its customers a variety of payment methods. You can place an order using Credit\/Debit Card, and COD (cash on delivery) payment methods. For international orders, you can use Credit\/Debit card option only as COD service is not available outside Pakistan.<\/p>"}},"cf9e9e4d-9465-4f20-a52e-a8e67a5b401b":{"type":"text","settings":{"button_heading":"How much does shipping cost?","button_content":"<p>Free delivery is provided upon purchase of Rs. 5,000 (Rupees five thousand) or above. For purchases less than that delivery cost of Rs.200 (Rupees two hundred) is charged. For International Orders shipping rates are calculated based on the destination and the weight of the ordered shipment.<\/p>"}},"0f1c6daa-6e9c-4468-9043-fd1caedc24f8":{"type":"text","settings":{"button_heading":"What are your delivery areas?","button_content":"<p>We deliver all over the World through 3rd Party Logistic services i.e., Leopard and Swyft for deliveries in Pakistan and DHL for the rest of the world.<\/p>"}},"f0b0b3ee-76ee-4ecb-bcaa-5f92e5512473":{"type":"text","settings":{"button_heading":"Can I change or cancel my order?","button_content":"<p>If you want to cancel or modify your order, then you may contact us via email i.e., info@adoro.com.pk. You cannot cancel or modify your order once your order has been shipped from Adoro premises.<\/p>"}},"d3099a97-2734-41bd-a08c-da6d25a29191":{"type":"text","settings":{"button_heading":"How is my order shipped?","button_content":"<p>Orders are shipped from Monday to Saturday, excluding those Saturdays on which Company Offices remain closed, Sunday’s public holidays. We ship your order using 3rd party Logistics i.e., Leopard and Swyft for Pakistan and DHL for International Orders.<\/p>"}},"84c48b8c-484e-4836-b7e4-8bf7a562f2a2":{"type":"text","settings":{"button_heading":"How can I track my delivery?","button_content":"<p>To get update regarding your order tracking please contact us on info@adoro.com.pk our representative will inform you with latest updates.<\/p>"}},"5e4c3d6c-34c9-4a8e-a963-13b283495791":{"type":"text","settings":{"button_heading":"How long does it take for my order to reach me?","button_content":"<p>The order from Adoro within Pakistan will be delivered in 7 to 10 working days subject to provision of a valid address & stock availability. The estimate delivery time for international order ranged from 10 to 15 working days for in-stock items. However, force majeure events might delay or render impossible any deliveries.<\/p>"}},"71440ed6-ece9-4394-b815-c58efbd02381":{"type":"text","settings":{"button_heading":"What happens if I receive a damaged product\/item?","button_content":"<p>Please report the damaged item at info@adoro.com.pk, our Customer Care representative will contact on your email id, so our Customer Care Representative will assist you accordingly<\/p>"}},"d40c4086-f756-46ee-a69d-a6e03b60fec8":{"type":"text","settings":{"button_heading":"What if the product is out of stock?","button_content":"<p>If the Product is shown out of stock. Please contact on our email: info@adoro.com.pk and we will try our best to arrange it.<\/p>"}},"5c78a684-d0f0-40a3-ad9b-c78177710559":{"type":"text","settings":{"button_heading":"What is full-grain leather?","button_content":"<p>Full grain leather is the highest quality and most durable leather made from the top layer of an animal's hide, retaining its natural texture and character. It's known for strength, longevity, and unique beauty with natural markings and patina. Used in luxury products, with proper care, it lasts for years.<\/p>"}},"d23c7d5b-2cad-4f5a-8562-5d9f7a56e8bc":{"type":"text","settings":{"button_heading":"What types of soles do we use?","button_content":"<p>Our shoes are made from high-quality, genuine leather that is sourced from the finest tanneries around the world. Further more We are using sheet soles, rubber sole for the majority of our shoes and boots. Not only do they look amazing, they are flexible and durable.<\/p>"}},"d1358e45-81be-4b1f-8f7c-d4ab864d6486":{"type":"text","settings":{"button_heading":"What do I do, if the handle comes off my bag?","button_content":"<p>In the unlikely case something like this happens, we will of course help. Please contact Customer Service right away.<\/p>"}},"850d2cd7-5caf-4ac2-87d8-1279685b7708":{"type":"text","settings":{"button_heading":"Is it important to clean and look after the leather products?","button_content":"<p>Proper care and maintenance of leather are essential to prevent drying out, cracking, or fading. Regular cleaning and conditioning with appropriate products can keep leather soft, supple, and looking good for years. Wipe down with a damp cloth to remove dirt and dust and condition to keep it moisturized.<\/p>"}},"00abad5c-c10a-4a4d-b9f6-40bb80ac3970":{"type":"text","settings":{"button_heading":"How often should I look after my leather products?","button_content":"<p>Regular care of your leather products is essential and the regularity depends on how often you use your leather products. However, in general, it's recommended that you clean and condition leather products at least once every three to six months.<\/p>"}},"b7560ce2-97e0-4963-aaeb-93bdfe1b7f25":{"type":"text","settings":{"button_heading":"Is it essential to use leather lotion?","button_content":"<p>Yes, it is! Leather lotion is going to help keep the moisture in the leather. It is best applied to the underside of the leather so that it gets properly absorbed into the leather.<\/p>"}},"5675010e-6ef5-439d-9624-1f453b3ec02d":{"type":"text","settings":{"button_heading":"Should I use a dust bag?","button_content":"<p>Our leather products come with a Taffeta dust bag for safe storage and protection from scratches. The lightweight and smooth fabric is often used in high-end fashion for its lustrous and silky texture. Always use a dust bag for short-term storage.<\/p>"}},"2bd6043d-bf7b-41b9-84f9-4e87e8ab3131":{"type":"text","settings":{"button_heading":"How should I correctly store my leather products for long term?","button_content":"<p>Whatever you do, don't store your leather bag in a damp place. Store it in a place that is not too warm nor cold to keep it safe. Always use the dust bag that you received with our premium products box.<\/p>"}},"e3a589c7-5c8f-4ee1-af97-ff91908d7041":{"type":"text","settings":{"button_heading":"Why is shining shoes is so important?","button_content":"<p>Conditioning and polishing leather shoes is crucial for their longevity, as leather is a skin that requires treatment to remain healthy. Without proper treatment, even the best leather can break down quickly, making it a poor investment.<\/p>"}},"00b753e5-b401-419a-a96c-444041284435":{"type":"text","settings":{"button_heading":"How will my leather age? Does full-grain leather scratch easily?","button_content":"<p>Our leather goods are made to go along with you on all of your adventures! Even so, full-grain leather can be very vulnerable the first few weeks of its life and scuffs and scratches are part of the territory. Overall, while full-grain leather may scratch more easily than some other materials, it is still a durable and high-quality material that can last for many years with proper care.<\/p>"}},"5ac3b408-d0ad-42e1-9872-b4e0077abdcf":{"type":"text","settings":{"button_heading":"What is the difference between Suede and Leather?","button_content":"<p>Suede is made from the inner layer of an animal hide, which is buffed to create a soft, velvety texture, while leather is made from the outer layer of an animal hide, creating a smooth and durable material. Suede is more delicate and susceptible to damage than leather, which is often thicker and more durable.<\/p>"}}},"block_order":["ce3f264c-63c3-4dff-9c24-d43aadbfcd72","b60be7a9-c3d7-466b-800d-ac7e6f5d5f97","6e59c27c-5a19-43eb-b930-0e8932cc3879","45afb32a-4202-40fd-8031-366ad480440b","cf9e9e4d-9465-4f20-a52e-a8e67a5b401b","0f1c6daa-6e9c-4468-9043-fd1caedc24f8","f0b0b3ee-76ee-4ecb-bcaa-5f92e5512473","d3099a97-2734-41bd-a08c-da6d25a29191","84c48b8c-484e-4836-b7e4-8bf7a562f2a2","5e4c3d6c-34c9-4a8e-a963-13b283495791","71440ed6-ece9-4394-b815-c58efbd02381","d40c4086-f756-46ee-a69d-a6e03b60fec8","5c78a684-d0f0-40a3-ad9b-c78177710559","d23c7d5b-2cad-4f5a-8562-5d9f7a56e8bc","d1358e45-81be-4b1f-8f7c-d4ab864d6486","850d2cd7-5caf-4ac2-87d8-1279685b7708","00abad5c-c10a-4a4d-b9f6-40bb80ac3970","b7560ce2-97e0-4963-aaeb-93bdfe1b7f25","5675010e-6ef5-439d-9624-1f453b3ec02d","2bd6043d-bf7b-41b9-84f9-4e87e8ab3131","e3a589c7-5c8f-4ee1-af97-ff91908d7041","00b753e5-b401-419a-a96c-444041284435","5ac3b408-d0ad-42e1-9872-b4e0077abdcf"],"settings":{"heading":"FAQ's"}}},"order":["main","4d857918-30a5-4284-9758-90cf1d9f713a"]}